#+TITLE: User Interface File
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+note: This file adds Brother Neffs code of checklist and things to be added when making the tables for the competitions
#+note: hello world Brother Neffs code of checklist and things to be added when making the tables for the competitions

_*NEFF CODE*_ 
* Tests
#+BEGIN_SRC emacs-lisp :results raw
  (setq opl (org-get-plain-list "groceries")
        ans (org-element-property :name opl))
#+END_SRC

#+RESULTS:
groceries
groceries
groceries

#+BEGIN_SRC emacs-lisp :results raw
  (get-checkbox-list-values "groceries")
#+END_SRC

#+RESULTS:
(milk butter yogurt)
(milk butter)

#+BEGIN_SRC emacs-lisp :results raw
  (validate-radio-list (get-checkbox-list-values "age"))
#+END_SRC

#+RESULTS:
Invalid or unanswered.
Collegiate

#+BEGIN_SRC emacs-lisp :results raw
  (validate-radio-list (get-checkbox-list-values "level"))
#+END_SRC

#+RESULTS:
Invalid or unanswered.
Gold 1




_DANCE COMPETITION_
** CONSTRUCT TABLE

#+BEGIN_SRC elisp : results value
(build-tables num-judges num-couples)
#+END_SRC

#+RESULTS:
| Couple | A | B | C |
|--------+---+---+---|
|    111 |   |   |   |
|    112 |   |   |   |
|    113 |   |   |   |
|    114 |   |   |   |
|    115 |   |   |   |
|    116 |   |   |   |
|    117 |   |   |   |

**** _NAME THE DANCE_
#+BEGIN_SRC elisp :results silent
  (setq dance "cha-cha")
#+END_SRC

This create a variable named after the dance + table and the table
#+BEGIN_SRC elisp
  (set (intern (concat dance "-table")) (build-tables num-judges num-couples))
#+END_SRC

#+RESULTS:
| Couple | A | B | C | D | E |
|--------+---+---+---+---+---|
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |
|        |   |   |   |   |   |

#+BEGIN_SRC elisp 
  cha-cha-table
#+END_SRC


*** Results Table
#+BEGIN_SRC elisp 
  (defun results-table (num-couples couples)
  (append (list (append '(Couples) '(Rank)))
    (list 'hline)(body num-couples)))
#+END_SRC

#+RESULTS:
: results-table

#+BEGIN_SRC elisp
(results-table num-couples couples)
#+END_SRC

#+RESULTS:
| Couples | Rank |
|---------+------|
|     111 |      |
|     112 |      |
|     113 |      |
|     114 |      |
|     115 |      |
|     116 |      |
|     117 |      |


#+BEGIN_SRC emacs-lisp :results code
  (defun string-to-symbol (string)
    (intern (downcase (replace-regexp-in-string " " "-" string))))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC emacs-lisp
string-to-symbol
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun make-results-symbols (dance-symbols)
    (mapcar 'make-results-symbol dance-symbols))
#+END_SRC

#+RESULTS:
: make-results-symbols

#+BEGIN_SRC emacs-lisp
  (defun make-results-symbol (dance-symbol)
    (intern (concat (symbol-name dance-symbol) "-results")))
#+END_SRC
#+RESULTS:
: make-results-symbol

#+BEGIN_SRC emacs-lisp
  (make-results-symbols dance-list)
#+END_SRC

#+RESULTS:
| is--viennese-waltz-results | il--jive-results | il--samba-results | ar--east-coast-swing-results | salsa-results |
